fep-jmeter-plugin/examples/FISC_Test_Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="FISC 財金交易測試計畫" enabled="true">
      <stringProp name="TestPlan.comments">FEP JMeter Plugin 測試範例</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="FISC_HOST" elementType="Argument">
            <stringProp name="Argument.name">FISC_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="FISC_PORT" elementType="Argument">
            <stringProp name="Argument.name">FISC_PORT</stringProp>
            <stringProp name="Argument.value">9000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="INSTITUTION_ID" elementType="Argument">
            <stringProp name="Argument.name">INSTITUTION_ID</stringProp>
            <stringProp name="Argument.value">012</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TERMINAL_ID" elementType="Argument">
            <stringProp name="Argument.name">TERMINAL_ID</stringProp>
            <stringProp name="Argument.value">ATM00001</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TEST_PAN" elementType="Argument">
            <stringProp name="Argument.name">TEST_PAN</stringProp>
            <stringProp name="Argument.value">4111111111111111</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- ========================================== -->
      <!-- Thread Group 1: 網路管理測試 (Sign-On/Echo) -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="01. 網路管理測試" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Sign-On 測試 -->
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="FISC Sign-On" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">SIGN_ON</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼 00" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Sign-On 失敗</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- Echo Test -->
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="FISC Echo Test" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">ECHO_TEST</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼 00" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Echo Test 失敗</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- Sign-Off -->
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="FISC Sign-Off" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">SIGN_OFF</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree/>
      </hashTree>

      <!-- ========================================== -->
      <!-- Thread Group 2: 餘額查詢測試 -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="02. 餘額查詢測試" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="餘額查詢" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">BALANCE_INQUIRY</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
          <stringProp name="pan">${TEST_PAN}</stringProp>
          <stringProp name="processingCode">310000</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">餘額查詢失敗</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="記錄餘額" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def balance = vars.get("FISC_BALANCE")
if (balance != null) {
    log.info("查詢餘額: " + balance)
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ========================================== -->
      <!-- Thread Group 3: 跨行提款測試 -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="03. 跨行提款測試" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="跨行提款 NT$1,000" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">WITHDRAWAL</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
          <stringProp name="pan">${TEST_PAN}</stringProp>
          <stringProp name="processingCode">010000</stringProp>
          <stringProp name="amount">100000</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">提款交易失敗</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ========================================== -->
      <!-- Thread Group 4: 跨行轉帳測試 -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="04. 跨行轉帳測試" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="跨行轉帳 NT$500" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">TRANSFER</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
          <stringProp name="pan">${TEST_PAN}</stringProp>
          <stringProp name="processingCode">400000</stringProp>
          <stringProp name="amount">50000</stringProp>
          <stringProp name="customFields">103:00000012345678901234</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">轉帳交易失敗</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ========================================== -->
      <!-- Thread Group 5: 代繳費測試 -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="05. 代繳費測試" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">2</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="代繳電費 NT$1,234" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">BILL_PAYMENT</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
          <stringProp name="pan">${TEST_PAN}</stringProp>
          <stringProp name="processingCode">500000</stringProp>
          <stringProp name="amount">123400</stringProp>
          <stringProp name="customFields">43:台灣電力公司;48:9912345678</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">繳費交易失敗</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ========================================== -->
      <!-- Thread Group 6: 壓力測試 -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="06. 壓力測試 (Echo)" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="Echo Test (壓測)" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">ECHO_TEST</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${TERMINAL_ID}</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="思考時間 100ms" enabled="true">
            <stringProp name="ConstantTimer.delay">100</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ========================================== -->
      <!-- 監聽器 (Listeners) -->
      <!-- ========================================== -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="檢視結果樹" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="彙總報告" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="彙總圖表" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="回應時間圖表" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>